test/request-response-samples/addList__complex_extension_namespace_for_arrays/request.xml

<?xml version="1.0" encoding="UTF-8" standalone="yes"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
<soap:Header/>
<soap:Body>
		<ns1:addList xmlns:ns1="urn:messages_2011_1.platform.webservices.netsuite.com">
		<ns1:record xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:ns3="relationships_2011_1.lists.webservices.netsuite.com" xsi:type="ns3:Contact">
				<firstName>First-1400867779067</firstName>
				<lastName>Sullivan</lastName>
				<phone>800-555-2819</phone>
				<subsidiary internalId="1" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:ns2="core_2011_1.platform.webservices.netsuite.com" xsi:type="ns2:RecordRef"/>
		</ns1:record>
		<ns4:record xmlns:ns4="urn:messages_2011_1.platform.webservices.netsuite.com" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:ns6="relationships_2011_1.lists.webservices.netsuite.com" xsi:type="ns6:Contact">
				<firstName>aLFirst-1400867779067</firstName>
				<lastName>Sullivan</lastName>
				<phone>800-555-2819</phone>
				<subsidiary internalId="1" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:ns5="core_2011_1.platform.webservices.netsuite.com" xsi:type="ns5:RecordRef"/>
		</ns4:record>
		</ns1:addList>
</soap:Body>
</soap:Envelope>